ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>cbr_ПересечениеМенеджеров</name>
    <comment>//++ БаженоваЕО 27.01.2026 ПРД.18</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>cbr_ТЧПересечениеМенеджеров</name>
    <comment>//++ БаженоваЕО 27.01.2026 ПРД.18</comment>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура cbr_МенеджерПриИзмененииПосле(Элемент)
	
	//++ БаженоваЕО 29.01.2026 ПРД.18
	Если ЗначениеЗаполнено(Объект.Менеджер) Тогда
		Объект.cbr_ТЧПересечениеМенеджеров.Очистить();
		НоваяСтрока = Объект.cbr_ТЧПересечениеМенеджеров.Добавить();
		НоваяСтрока.ФизическоеЛицо = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Менеджер,"ФизическоеЛицо");
		НоваяСтрока.Процент = 100;
	КонецЕсли;
	//-- БаженоваЕО 29.01.2026
	
КонецПроцедуры

//++ БаженоваЕО 29.01.2026 ПРД.18
&НаКлиенте
Процедура cbr_ПересечениеМенеджеровПриИзменении(Элемент)
	
	Элементы.ПересечениеМенеджеров.Видимость = Объект.cbr_ПересечениеМенеджеров;

КонецПроцедуры //-- БаженоваЕО 29.01.2026

#КонецОбласти
